posts/bulk-foods.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-24 Thu 12:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bulk food store prices</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="James" />
<link rel="stylesheet" type="text/css" href="../static/common.css" />
<link rel="icon" type="image/ico" href="../static/icon/favicon.svg" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Bulk food store prices</h1>
<div class="metadata">
<p>
Written by <i>James</i> on <i>10 Sep, 2020</i> | <a href="../index.html">Other blog posts</a>
</p>

</div>

<p>
Lately we've been shopping more at our local bulk foods store, <a href="https://thesourcebulkfoods.com.au/">The Source</a>. It's good for finding interesting foods. The 6 grain porridge mix has been a welcome addition to our breakfast rotation.
</p>

<p>
It also removes the need to go through as many soft plastic packages each week. It doesn't seem like much, but it adds up over time. The store has a bunch of paper bags, same as the mushroom bags at Coles/Woolies, or you can just bring your own containers.
</p>

<p>
In theory the bulk food store ingredients should be cheaper than a plastic packaged equivalent, but it always feels more expensive. It's hard to tell since it's all weight based, so lets have a look at the numbers.
</p>

<table id="orgef27e87" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> <a href="#orgef27e87">Cost per 100g</a></caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Ingredient</th>
<th scope="col" class="org-left">The Source</th>
<th scope="col" class="org-left">Woolies</th>
<th scope="col" class="org-left">Coles</th>
<th scope="col" class="org-right">Hipster tax (%)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Australian Oats</td>
<td class="org-left">$ 0.49</td>
<td class="org-left">$ 0.19</td>
<td class="org-left">$ 0.18</td>
<td class="org-right">165</td>
</tr>

<tr>
<td class="org-left">Chickpeas</td>
<td class="org-left">$ 1.65</td>
<td class="org-left">$ 0.48</td>
<td class="org-left">$ 0.48</td>
<td class="org-right">244</td>
</tr>

<tr>
<td class="org-left">Organic plain flour</td>
<td class="org-left">$ 0.45</td>
<td class="org-left">$ 0.45</td>
<td class="org-left">$ 0.45</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Plain flour^</td>
<td class="org-left">$ 0.45</td>
<td class="org-left">$ 0.10</td>
<td class="org-left">$ 0.09</td>
<td class="org-right">374</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Jasmine rice^</td>
<td class="org-left">$ 1.00</td>
<td class="org-left">$ 0.32</td>
<td class="org-left">$ 0.35</td>
<td class="org-right">199</td>
</tr>

<tr>
<td class="org-left">Organic Jasmine rice</td>
<td class="org-left">$ 1.00</td>
<td class="org-left">$ 0.64</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">56</td>
</tr>

<tr>
<td class="org-left">Brown rice^</td>
<td class="org-left">$ 1.20</td>
<td class="org-left">$ 0.35</td>
<td class="org-left">$ 0.33</td>
<td class="org-right">253</td>
</tr>

<tr>
<td class="org-left">Organic brown rice</td>
<td class="org-left">$ 1.20</td>
<td class="org-left">$ 0.47</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">155</td>
</tr>

<tr>
<td class="org-left">Medium grain rice^</td>
<td class="org-left">$ 0.80</td>
<td class="org-left">$ 0.33</td>
<td class="org-left">$ 0.35</td>
<td class="org-right">135</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Raw cashews</td>
<td class="org-left">$ 2.90</td>
<td class="org-left">$ 2.20</td>
<td class="org-left">$ 2.25</td>
<td class="org-right">30</td>
</tr>

<tr>
<td class="org-left">Almonds</td>
<td class="org-left">$ 2.20</td>
<td class="org-left">$ 1.71</td>
<td class="org-left">$ 1.50</td>
<td class="org-right">37</td>
</tr>
</tbody>
</table>
<blockquote>
<p>
<b>^</b> These items are only available as organic from The Source, but are compared to non-organic from Coles/Woolies
</p>
</blockquote>

<p>
Looks like we've been paying a pretty large hipster tax. Some of this can be forgiven since The Source only carries organic varieties of some ingredients. If you opt for the organic rices from Coles and Woolies you'd get something closer to The Source's price. Other ingredients like the oats and chickpeas, which aren't organic from The Source, are more than twice the price. Even for nuts you'll expect to pay an extra 30%.
</p>

<p>
The results are dissapointing from a cost point of view. The Source is a little bit out of our way, but we're usually happy to go to save a few extra bags of plastic. It's hard to justify the much higher costs though.
</p>

<p>
For now, I'll still be heading there for the interesting products that aren't available at other supermarkets: 6 grain mixes, interesting flours and loose tea leaves. That said, I might have to reconsider getting staple foods there.
</p>

<p>
For those soft plastic packages, I'll write another post soon about <a href="plastic-recycling.html">soft-plastic recycling</a>.
</p>
</div>
</body>
</html>
